In [38]:
import pandas as pd
import numpy as np
from numpy.random import randn as rn

In [39]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [40]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
# df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [ ]:
# 1. Some values in the the FlightNumber column are missing. These numbers are
# meant to increase by 10 with each row so 10055 and 10075 need to be put in
# place. Fill in these missing numbers and make the column an integer column
# (instead of a float column).

In [14]:
# df['FlightNumber'].isnull()

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

In [16]:
# df[df['FlightNumber'].isnull() == True]

,From_To,FlightNumber,RecentDelays,Airline,"(1, FlightNumber)"
1,MAdrid_miLAN,NaN,[],<Air France> (12),10055
3,Budapest_PaRis,NaN,[13],12. Air France,10055

In [17]:
# pd.isnull(df)

   From_To  FlightNumber  RecentDelays  Airline  (1, FlightNumber)
0    False         False         False    False              False
1    False          True         False    False              False
2    False         False         False    False              False
3    False          True         False    False              False
4    False         False         False    False              False

In [11]:
# index = np.where(df['FlightNumber'].isnull())

In [12]:
# index

(array([1, 3], dtype=int64),)

In [21]:
# df

,From_To,FlightNumber,RecentDelays,Airline,"(1, FlightNumber)"
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),10055
1,MAdrid_miLAN,NaN,[],<Air France> (12),10055
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),10055
3,Budapest_PaRis,NaN,[13],12. Air France,10055
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",10055

In [41]:
df[df['FlightNumber'].isnull() ==  True]

          From_To  FlightNumber RecentDelays            Airline
1    MAdrid_miLAN           NaN           []  <Air France> (12)
3  Budapest_PaRis           NaN         [13]     12. Air France

In [42]:
np.where(df['FlightNumber'].isnull()==True)

(array([1, 3], dtype=int64),)

In [43]:
pd.DataFrame(df)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [44]:
pd.DataFrame(df)[['FlightNumber']]

   FlightNumber
0       10045.0
1           NaN
2       10065.0
3           NaN
4       10085.0

In [45]:
pd.DataFrame(df)['FlightNumber'][1] = 10055

In [46]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [47]:
pd.DataFrame(df)['FlightNumber'][3] = 10075

In [48]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [37]:
# df.dtypes

From_To               object
FlightNumber         float64
RecentDelays          object
Airline               object
(1, FlightNumber)      int64
dtype: object

In [50]:
df['FlightNumber'] = df['FlightNumber'].astype('int')

In [39]:
# df.dtypes

From_To              object
FlightNumber          int32
RecentDelays         object
Airline              object
(1, FlightNumber)     int64
dtype: object

In [40]:
# df

,From_To,FlightNumber,RecentDelays,Airline,"(1, FlightNumber)"
0,LoNDon_paris,10045,"[23, 47]",KLM(!),10055
1,MAdrid_miLAN,10055,[],<Air France> (12),10055
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),10055
3,Budapest_PaRis,10075,[13],12. Air France,10055
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",10055

In [ ]:
# 2. The From_To column would be better as two separate columns! Split each
# string on the underscore delimiter _ to give a new temporary DataFrame with
# the correct values. Assign the correct column names to this temporary
# DataFrame.

In [51]:
df['From'] = df.From_To.str.split('_').str[0]

In [52]:
df

            From_To  FlightNumber  RecentDelays              Airline      From
0      LoNDon_paris         10045      [23, 47]               KLM(!)    LoNDon
1      MAdrid_miLAN         10055            []    <Air France> (12)    MAdrid
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )    londON
3    Budapest_PaRis         10075          [13]       12. Air France  Budapest
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"  Brussels

In [53]:
df['To'] = df.From_To.str.split('_').str[1]

In [54]:
df['To']

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: To, dtype: object

In [55]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [ ]:
# 3. Notice how the capitalisation of the city names is all mixed up in this
# temporary DataFrame. Standardise the strings so that only the first letter is
# uppercase (e.g. "londON" should become "London".)

In [56]:
df['From_To']

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [57]:
df[['From_To']]

            From_To
0      LoNDon_paris
1      MAdrid_miLAN
2  londON_StockhOlm
3    Budapest_PaRis
4   Brussels_londOn

In [59]:
for i in df['From_To']:
    print(i)

LoNDon_paris
MAdrid_miLAN
londON_StockhOlm
Budapest_PaRis
Brussels_londOn

In [60]:
[i[0] for i in df['From_To']]

['L', 'M', 'l', 'B', 'B']

In [61]:
[i[0] for i in df['From_To']]

['L', 'M', 'l', 'B', 'B']

In [62]:
 [i[0].capitalize() for i in df['From_To']]

['L', 'M', 'L', 'B', 'B']

In [65]:
df['From_To'] = df['From_To'].str.upper()

In [66]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LONDON_PARIS,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MADRID_MILAN,10055,[],<Air France> (12),MAdrid,miLAN
2,LONDON_STOCKHOLM,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,BUDAPEST_PARIS,10075,[13],12. Air France,Budapest,PaRis
4,BRUSSELS_LONDON,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [ ]:
# 4. Delete the From_To column from df and attach the temporary DataFrame
# from the previous questions.

In [67]:
# df.drop('From_To') # Gives Error as by default the axis = 0 i.e Row wise it will search 
df.drop('From_To', axis = 1)

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [68]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LONDON_PARIS,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MADRID_MILAN,10055,[],<Air France> (12),MAdrid,miLAN
2,LONDON_STOCKHOLM,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,BUDAPEST_PARIS,10075,[13],12. Air France,Budapest,PaRis
4,BRUSSELS_LONDON,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [69]:
df.drop('From_To', axis = 1, inplace=True)

In [70]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [35]:
# 5. In the RecentDelays column, the values have been entered into the
# DataFrame as a list. We would like each first value in its own column, each  
# second value in its own column, and so on. If there isn't an Nth value, the value
# should be NaN.
# Expand the Series of lists into a DataFrame named delays, rename the columns
# delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
# with delays.

In [71]:
df[['RecentDelays']]

   RecentDelays
0      [23, 47]
1            []
2  [24, 43, 87]
3          [13]
4      [67, 32]

In [101]:
df.columns

Index(['FlightNumber', 'RecentDelays', 'Airline', 'From', 'To'], dtype='object')

In [107]:
df[['RecentDelays']]

   RecentDelays
0      [23, 47]
1            []
2  [24, 43, 87]
3          [13]
4      [67, 32]

In [122]:
for i in df.RecentDelays:
    print(i)

[23, 47]
[]
[24, 43, 87]
[13]
[67, 32]